[
  "Applejack And Rarity Leave Ponyville",
  "Bartleby Takes his Sugar Baby Sonic To A Hot Spring Vacation",
  "Bartleby Teaches His Boyfriend Sonic The Hedgehog How To Swim",
  "My Little Pony Coco Pommel Has Her Heart Stolen",
  "My Little Pony Fluttershy's Hot Pot Party",
  "My Little Pony Pinkie Pie Goes Bowling with Twilight's Family",
  "My Little Pony Pinkie Pie's Sleepover",
  "My Little Pony Rainbow Dash's Birthday Bash",
  "My Little Pony StarSong and Toola Roola Come to Visit",
  "My Little Pony the Movie Hearth's Warming in Manehattan",
  "My Little Pony the Movie Soarin & Braeburn",
  "My Little Pony the Movie The Death of Twilight Sparkle",
  "MY LITTLE PONY THE MOVIE： INFECTION",
  "My Little Pony The Movie： Shattered Harmony",
  "My Little Pony The Movie： The Death Of Trixie Lulamoon",
  "My Little Pony： Pinkie Pie Participates in a Joke-Off",
  "My Little Pony： Twilight Sparkle & Friends Get A Hotel Room",
  "My Little Pony： Twilight Sparkle Fights a Clown？？？？？？",
  "Queen Aleena And Her Kids Go On Vacation And Her Son Sonic Poops On The bed",
  "Rainbow Dash Must Perform the Sonic Rainboom One Finale Time or Die Trying",
  "Scootaloo Introduces Rainbow Dash to Her Family at the Hometown Buffet",
  "Sonia the Hedgehog gets into a fight at school then gets suspended",
  "Sonic And Friends Go To The Cemetery To Fight With Ghosts",
  "Sonic Goes To Uncle Chucks For 4Th Of July",
  "Sonic Manic and Sonia celebrate their birthday at Chuck E. Cheese's and things go VERY wrong...",
  "Sonic The Hedgehog & His Hot Boyfriend Works At A Bakery",
  "Sonic The Hedgehog & The Extraordinary Yard Sale Adventure!",
  "Sonic The Hedgehog And Friends Throw A Secret Santa Party",
  "Sonic The Hedgehog And His Gay Lover Bartleby Stop A Shoplifter At Walmart",
  "Sonic The Hedgehog And The Evil Dr. Robotnik Battle For The Playstation 5",
  "Sonic The Hedgehog And The Great Sand Castle Competition",
  "Sonic The Hedgehog Duels Yugi Muto To Become The King Of Games L Full Episode",
  "Sonic The Hedgehog Enters A Bake-Off At The County Fair With His Gay Lover Bartleby Montclair",
  "Sonic The Hedgehog Goes Hiking",
  "Sonic the Hedgehog goes to 7-Eleven",
  "Sonic The Hedgehog Goes To The Oracle Of Delphius's 87Th Birthday Party",
  "Sonic The Hedgehog Takes His Boyfriend Bartleby To The Dollar Store",
  "Sonic the hedgehog takes the bus to school",
  "Sonic the Hedgehog the movie - The Big Pizza Hut Brawl",
  "Sonic Underground - Adventures In Wonderland",
  "Sonic Underground - Bartleby(And His Boyfriend Sonic) Go To The Movies To Watch M3gan",
  "Sonic Underground - Bartleby, The Bitch, And The Wardrobe",
  "Sonic Underground - Gerald Finds A F＊cked Up Room In Sid The Science Kids House (Graphic Content)",
  "Sonic Underground - Manic the Hedgehog and Mindy get married!",
  "Sonic Underground - Mindy House Sits For Bartleby And Loses Everything (Dedicated to Akira Toriyama)",
  "Sonic Underground - Mindy's Dad Throws a 4th Of July Party A Week Late Because He Forgot (ft. Ninja)",
  "Sonic Underground - Mindy's Sisters Come To Visit",
  "Sonic Underground - Neighborhood Cookout",
  "Sonic Underground - Queen Aleena Gets Fired On Christmas",
  "Sonic Underground - Sonic And His Beautiful Boyfriend Go Roller Skating For Valentines Day",
  "Sonic Underground - Sonic Experiences A Tragic Death On Christmas",
  "Sonic Underground - Sonic Meets Bartleby's Parents",
  "Sonic Underground - Sonic The Hedgehog Gets Stuck In An Elevator With His Gay Lover",
  "Sonic Underground - Sonic the Hedgehog Makes His Dream Come True ✧∘＊ ✧･ﾟ (By any means necessary)",
  "Sonic Underground - Sonic The Hedgehog Saves Christmas",
  "Sonic underground - Sonic the Hedgehog's Surprise Substitute Teacher!!",
  "Sonic Underground - Take Your Children To Work Day",
  "Sonic Underground - The Great Corn Maze Competition",
  "Sonic Underground - The Polar Express",
  "Sonic Underground - The Year Without A Christmas...",
  "Sonic Underground - Tyley Ross (Manics Voice Actor) Gets Kidnapped And Held For Ransom",
  "Sonic Underground Christmas Tree Special!",
  "Sonic Underground Episode - Manic the Hedgehog Gets His First Job",
  "Sonic Underground High School Musical",
  "Sonic Underground Origins - Sleet And Dingo",
  "Sonic Underground Revenge of the Sith (Full movie for kids) UNCENSORED",
  "Sonic Underground Summer Special： Sonic Goes The Pool And Almost Dies",
  "Sonic Underground The (Official) Movie - A Christmas Carol",
  "Sonic Underground The Movie - Bartleby Goes To Goodwill With His Boyfriend Sonic the hedgehog",
  "Sonic Underground The Movie - Bartleby Montclair Of Dresdin Spends Thanksgiving Day With The Lads",
  "Sonic Underground The Movie - Battle With The Boys",
  "Sonic Underground The Movie - Cyrus's Daddy Finally Comes Home",
  "Sonic Underground The Movie - Halloween Heroes",
  "Sonic Underground The Movie - Memorial Day At Burger King",
  "Sonic Underground The Movie - Sonic And Friends Put On A Play For Little Children",
  "Sonic Underground The Movie - Sonic Finds His Father",
  "Sonic Underground The Movie - Sonic Goes To Summer Camp",
  "Sonic Underground The Movie - Sonic Meets Hatsune Miku",
  "Sonic Underground The Movie - World War 3",
  "Sonic Underground The Movie Doctor Robotnik Has Had Enough",
  "Sonic Underground The St. Patricks Day Special",
  "Sonic Underground Uncle Chuck THROWS DOWN At The Chili Cook-Off while NAKED!!",
  "Sonic Underground Valentines Day Special",
  "Sonic Underground： Bartleby And His Boyfriend Sonic the Hedgehog Play Minecraft... (For A Date!!!)",
  "Sonic Undergruond The Great Easter Egg Hunt",
  "Sonic(And His Lover Bartleby) Fist Fight The Oracle Of Delphius",
  "The Sonic Underground Characters Go To The Renaissance Festival",
  "There's an Oompa Loompa Uprising In Willy Wonka's Chocolate Factory... And Only Sonic Can STOP it!",
  "Twilight Sparkle and Friends Get Stuck in a Porta Potty",
  "Uncle Chuck Drives An Ice Cream Truck And Gets Threatened By Mindy's Dad"
]