[
  {
    "file": "2011-04-12 - Sexy Manic Hedgehog.png",
    "description": ""
  },
  {
    "file": "2011-05-14 - Bardonic Fishing.png",
    "description": "Bartleby and Sonic decide to go fishing... for love. 😉"
  },
  {
    "file": "2011-05-16 - Best animation in year's....png",
    "description": ""
  },
  {
    "file": "2011-05-17 - Sonic underground Maze.png",
    "description": ""
  },
  {
    "file": "2011-05-19 - Sexy sonic hedgehog.png",
    "description": ""
  },
  {
    "file": "2011-05-27 - Baseball game features glory.png",
    "description": ""
  },
  {
    "file": "2011-07-15 - Sonic Underground wallscroll.png",
    "description": ""
  },
  {
    "file": "2011-09-23 - Haters gonna hate.png",
    "description": ""
  },
  {
    "file": "2011-10-11 - manic vs gaara.png",
    "description": ""
  },
  {
    "file": "2011-11-28 - Bardonic collecting space rocks.png",
    "description": ""
  },
  {
    "file": "2011-11-28 - Sonic the hedgehog A space oddysy.png",
    "description": ""
  },
  {
    "file": "2012-01-02 - My sons drawing of manic.png",
    "description": ""
  },
  {
    "file": "2012-01-14 - Manics maze!!! Free download!!!.png",
    "description": ""
  },
  {
    "file": "2012-03-11 - Bartleby and Sonic Sweet fluid's.png",
    "description": "Bartleby and Sonic making cookies. Soft cookies! and don't worry people. That's just frosting! 😉"
  },
  {
    "file": "2012-03-11 - Sonic Underground Bartleby+Sonic Pool Party!.png",
    "description": "It's A hot summer day as Sonic and his lover Bartleby, Montclaire of Dresdin decided to go for A dip in there backyard pool, but just as Sonic got gone blowing up his inner tube, he dropped if in A plant.\r\n\r\nHe reached down to grasp his tube, unaware that his speedo has snapped open revealing his rear end. The beautiful mink could not handle himself however and decided to turn the hose on those big round grapefruits."
  },
  {
    "file": "2012-03-13 - Bardonic - St. Patrick's day (In the Work's.png",
    "description": ""
  },
  {
    "file": "2012-03-13 - Bartleby and Sonic wish you all - !!!.png",
    "description": "Sonic has always believed the story about the story about the little green leprechaun and his pot of gold, but what he didn't know however...he... was the gold...\r\n\r\nIt was A rainy and stormy night. Rain was hitting lightning was flashing through the skies. Sonic could not sleep, so he made his way to the window. He enjoyed the view of his street at night. The street lights are always A golden orange, Black people are always mugging someone, and A bunch of Mexicans are alway's trying to fit into A giant van. (Sonic lives in the ghetto) Heh. Silly Mexicans. You couldn't do it last time, you wont be able to do it this time. Sonic thought to himself.\r\n\r\nAfter A couple hours they actually managed to do it. Sonic was at A lost for words. After some more hours passed. He decided to finally get some sleep. The rain was still fierce thought.\r\n\r\nSuddenly! Sonic saw A green flash by the window! \"A leprechaun?!\" Sonic ran strait downstairs and out the front door! He looked all around but couldn't find the midget in green. \"Son of A bitch! Give me your gold!\" Sonic shouted to the sky. \"No cracker, but i'd lover for you to give me your gold.\" Sonic turned to see A gang of black people. \"Ah shit.\" Sonic said out loud.\r\n\r\nSonic tried to run, but the black people were to fast and strong for the small fat hedgehog. They took all his money and gave him A good beating. Sonic was laying on the ground all bloody as he saw the leprechaun on the roof this time.\r\n\r\n\"You!\" Sonic shouted as he got the latter from his garage and climbed up on his window. What he saw up there was the craziest thing he has ever seen.\r\n\r\nA rainbow... Connected from his roof, to A field far off in the distance. He saw the leprechaun running across the rainbow so he followed post haste! \"Get back her and give me my gold!\" He screamed at the top of his lungs.\r\n\r\nHe almost slipped and fell off the rainbow multiple times do to the rain. If he fell from this height... H...he would die?! After about an hour of constant running passed he finally got about 75%. He then began to feel himself start to slide down on his own. His back slammed against the rainbow! He was sliding down the rainbow at nigga speed!\r\n\r\nHe stuck his fingers in the rainbow to try and slow himself down... but he was going to fast! He fingers began to bleed from the pain! He looked down and saw the leprechaun in the pot of gold! \"You! Please! SAVE MEEEE!!!\" Suddenly the leprechaun removed his costume. It was non other than... Bartleby, Montclair of dresdin...\r\n\r\n\"No!!!\" Sonic screamed! Bartleby began to pull Sonic into the pot to rape the beautiful hedgehog! \"HELP ME\" Sonic screams could be heard for miles. but it didn't matter since he was in the middle of A field! Finally Bartleby got Sonic into the pot! Sonic cried. He was being raped by someone he thought was his friend... but was in All an act? Did he... never really love me?... Sonic thought to himself. Bartleby nodded yes. Almost as if he had read the hedgehog's mind. This frightened Sonic.\r\n\r\nAfter 4 hours of rape... Sonic found out what he really wanted. Not gold or power... but love. He gave his body to the mink. Now it wasn't rape... It was love..."
  },
  {
    "file": "2012-03-17 - Bartleby... My hero....png",
    "description": ""
  },
  {
    "file": "2012-03-17 - Mindick (Manic x Mindy) Kiss from above....png",
    "description": "Manic makes out with Mindy. Spiderman Style. 😉\r\n\r\nManic and Mindy belong to The creators of Sonic Underground."
  },
  {
    "file": "2012-03-17 - Mindick (Manic x Mindy) Poster.png",
    "description": ""
  },
  {
    "file": "2012-03-18 - Wine baby.png",
    "description": "Bartleby's wine baby...\r\n\r\n\r\n\r\n\r\nBartleby awaits sittin upon his king sized mattress. Or what he calls the mattress of the gods. And he was right... To sonic he was a god. Every day at noon sonic would bring him wine, but today when sonic entered the room...\r\n\r\nbartleby wasnt there. He heard the door slam behind him! But when he turned around... no one was there.\r\n\r\nThe hedgehog drops the cups and bottle full of wine of many varieties and tried to get the door open but it just wouldnt budge. He knew what was happening... Bartleby caught him! Sonic heard a voice... \"hello wine baby\"\r\nSonic looked around but he couldnt find where to voice was coming from! It was as if the sound was coming from all round him. But as he was spinning something caught his eye. He saw a window slightly open... He knew that was his only way of survival. He ran to the window and grabbed it sliding it upward.\r\n\r\nBut just as he did someone grabbed his arm. It was his lover bartleby! Sonic was screaming try to loosen the grip of his lover. This however angered the posh mink.\r\n\r\nBartlebys eyes started to spin rapidly as he gritted his teeth. He punched the hedgehog to the floor and grabbed a boss of wine, proceeding to beat the hedgehog's face with it until the bottle busted! Shooting shards of glass into the minks eyes.\r\n\r\nSonic hoped this would stop him... but to no avail... It only made bartleby madder! So bartleby continued to giggle and rape the beautiful hedgehog"
  },
  {
    "file": "2012-05-02 - Bardonic (Bartleby x Sonic) Pool Party Hi-Rez.png",
    "description": ""
  },
  {
    "file": "2012-06-26 - Bardonic (Bartleby x Sonic) My heart will Go on....png",
    "description": "Bartleby and Sonic have just survived the Titanic... but can they survive freezing to death? Or will they freeze... Together?...\r\n\r\nSonic: P...p...promise me!.... You'll never let go...\r\n\r\nBartleby: I promise... baby...\r\n\r\nClick to see the beautiful but sad youtube video that goes with it. 😦"
  },
  {
    "file": "2012-06-27 - Bardonic (Bartleby x Sonic) One ring....png",
    "description": ""
  },
  {
    "file": "2012-06-28 - Bardonic (Bartleby x Sonic) Cottage cheese.png",
    "description": "Don't worry guys. It's just whipped cream... Maybe... ;O"
  },
  {
    "file": "2012-06-28 - Bardonic (Bartleby x Sonic) Men in tights....png",
    "description": "Sonic ran and ran, but no matter where he wen't, Bartleby was close behind. Whether it was up in A tree, under water, in A valcano... he was always there... Waiting... watching... getting ready to rape the young beautiful hedgehog...\r\n\r\nSonic: Bartleby... Do you love me?...\r\nBartleby: Yes... Sonic...\r\nSonic: I know Bartleby... I know.\r\nBartleby: To late baby.\r\n\r\nIt was then that Bartleby began to rape the beautiful hedgehog. Was this rape... going to become love?... Yes...\r\n\r\nSonic: I love you Bartleby...\r\nBartleby: Shut up baby..."
  },
  {
    "file": "2012-06-28 - Bartleby poops dango....png",
    "description": ""
  },
  {
    "file": "2012-06-28 - Mindick (Manic x Mindy) Making out....png",
    "description": ""
  },
  {
    "file": "2012-06-29 - Bardonic (Bartleby x Sonic) Nerd love.png",
    "description": "Bartleby and Sonic on there first day of school. Look's like Sonic has the hots for A certain someone \r\n\r\nSonic underground and all it's characters belong to me. So don't upload it to other sites or I will kick your ass."
  },
  {
    "file": "2012-06-29 - My new Sonic Underground Banner for deviantart .).png",
    "description": ""
  },
  {
    "file": "2012-07-01 - Bartleby's Mission....png",
    "description": ""
  },
  {
    "file": "2012-07-01 - Manic's Tears....png",
    "description": ""
  },
  {
    "file": "2012-07-01 - Sonic's Destiny....png",
    "description": ""
  },
  {
    "file": "2012-07-02 - THANK YOU FOR 500 PAGEVIEWS!!!.png",
    "description": "Thank you everyone for the 500 page views! I love you all. of course we all know who deserves the real credit here!\r\n\r\nme... The one man who takes the time to care about your worthless lives and make them meaningful... by giving you art. Thank you everyone... I couldn't have done it without you... 🙂"
  },
  {
    "file": "2012-07-03 - Manic x Mindy Fish food.png",
    "description": ""
  },
  {
    "file": "2012-07-07 - Bardonic (Bartleby x Sonic) Under the summer sun.png",
    "description": "Sonic and Bartleby have fun under the summer sun.\r\n\r\nI tried to go clean on this one. Have A happy summer everyone! :0"
  },
  {
    "file": "2012-07-07 - Bartleby and Garodor (Sonic) Make cookies..png",
    "description": ""
  },
  {
    "file": "2012-07-07 - HOW TO NOT DRAW LIKE A NOOB!!! TUTORIAL!!!.png",
    "description": ""
  },
  {
    "file": "2012-07-10 - Sonic caught up in chains..png",
    "description": ""
  },
  {
    "file": "2012-07-10 - Whatever we may face... We will do it together....png",
    "description": ""
  },
  {
    "file": "2012-07-12 - Bardonic (Bartleby x Sonic) Sonic's secret....png",
    "description": ""
  },
  {
    "file": "2012-07-18 - Bardonic (Bartleby x Sonic) Love at first sight....png",
    "description": ""
  },
  {
    "file": "2012-07-20 - Bardonic (Bartleby x Sonic) Saturday Morning.png",
    "description": "\"What A beautiful say it is\" Sonic said rising from his springy yet comfy bead and gazing out the window. The birds were singing. The flowers were blooming. There wasn't A cloud in the sky. Sonic knew today was going be the day he finally confessed his love to Bartleby the Mink who lives just across the street from the young hedgehog.\r\n\r\nHe was ready. He put on his favorite red shoes with the white stripe, his favorite white gloves, but most of all his royal medallion. He didn't put anything else on because he prefers to walk around naked. Just as he put the medallion on however... there was A loud crash downstairs in the kitchen. \" A thief?\" Sonic thought. Sonic has been living alone for the past 2 years since he moved out of his mothers place.\r\n\r\nSonic turned his medallion into his laser guitar and proceeded into the hallway. \"Okay thief. your about to see what happens when you mess with the blue wonder...\" Sonic made his way to the kitchen. the sound of crashing and banged getting louder with every step. 1... 2... 3!!! Sonic opened the door suprised at what he had seen! Nothing... no one was there, and everything was the same he had left it last night. He checked the front and back doors. Both... locked?... He checked all the windows. They were all firmly held shut. He checked every room in the house. Nothing. Was it just sonic's imagination? \"Oh well\" Sonic said. \" I guess I should just make breakfast now...\"\r\n\r\nSonic made his way over to the fridge to get the pancake better he had made the night before. When he opened the fridge however... it was gone... \"Where did it go? I could have sworn I put it in the fridge.\" Sonic wondered. Then he remembered! He keeps A camera recording in the kitchen just in case something happens to him and he needs help. He climbed up to the top of the fridge and retrieved the camera he speed backwards until he saw something caught his eye. Just an hour before Sonic had entered the room... Bartleby was here.\r\n\r\nOn the camera he appeared to be crying, eating all the pancake batter with his bare hands, and throwing shit around the kitchen breaking all of sonic's glass plates and cups. At the end of the video he heard Sonic coming down the stairs and pushed everything under the kitchen rug and... ran into the closet. Sonic turned off the camera and lifted up the rug. To his surprise all his broken shit was piled under there just like in the camera...\r\n\r\n\"and if that means the shit is really under the rug... then Bartleby must be in the...\" Sonic looked over at the closet and slowly walked towards it. \"Bartle...by?\" Sonic said slowly turning the knob. Sonic swung the door open but inside... was no Bartleby. Just A mob and some cleaning suprise. \"Huh? I thought he was suppose to be in he -\" Suddenly Sonic was grabbed by suprise.\r\n\r\n\"HELLO BABY\" Bartleby yelled putting his hand over the hedgehogs mouth! \"Marmufy... mhy?!..\" Sonic's voice was muffled by Bartlebys hand. \"YOU WONT GET AWAY FROM ME BABY!!!\" Bartleby began to lick Sonic all over his body! Sonic couldn't believe it! He was being raped by someone he was hoping to become lovers with!\r\n\r\nSonic finally pulled away, reached under the rug, and threw A broken dinner plate! Bartleby was hit over the side of the head. Blood ran down his face and only Sonic's body. The mink had managed to hold him down once again. Bartleby continued the attack. This time... Sonic was defenseless... There was nothing he could be but enjoyed the rape... Then he began to realize... Is this love?... \"I love you Bartleby...\" Sonic said....\r\n\r\nI know baby... I know.. Bartleby said with tears of joy..."
  },
  {
    "file": "2012-07-22 - I found you.png",
    "description": "Bartleby is breaking through the mirror...\r\n\r\nSonic was quick on his feet. He locked all his windows and doors and ran for his bedroom. He tripped over himself a couple of times, never before had he ran at such high speeds. He knew bartleby was coming to pay him a visit. why is bartleby paying a visit to the little blue hedgehog? Sonic was holding a bbq this nice and sunny after noon... although. He didnt invite bartleby, and the posh mink knew this all to well.o\r\n\"where should i hide? WHERE!\" Sonic looked around his room. All there was were a dresser... a tv... a bed... \"No. N where to hide\" the blue wonder thought to himself. Was there any place else to hide? Anywhere? Anywhere?!\r\n\"the closet\" Sonic said. He turned off all the lights in the house... hoping bartleby would think he was out. As he gripped the handle to the closet door. He heard the front door being broke open?! Sonic dived into the closet and prayed in the corner. He prayed to god that it wasnt a nigger... But it wasnt a nigger... it was bartleby...? \"I see you baby\" The hedgehog could hear shit being thrown around in his living room. Following that, he heard someone taking a shit and the toilet flushed. The toilet must have clogged up because he could swear he heard water splashing onto the floor and the closet was being filled with water, along bartleby cursing.\r\n\r\nThe hedgehog was now cowering in fear... All of a sudden he heard a silence that lasted for more 5 minutes. was the coast clear? The blue hedgehog slowing cracked the door opening until he hearing very loud footstops running towards his room. \"OH NO! HE HEARD ME! The hedgehog slammed the door shut and bumped against the mirror in the closet. He looked through the crack in the door... and there he was... Bartleby had walked into the bedroom. He could see... tears in his eyes...? He was crying...\r\n\"Why do you always run from me...\" The posh mink said with water filled eyes. And with that... sonic could hear him step out of the room along with the front door being opened and shut... Sonic casualy opened the closet door and headed down the hall to the kitchen. \"Well time to get shit for the bbq today...\" the hedgehog said.\r\nsonic reached for the hot dog buns in the cubbord. As soon as he did however... he heard laughing. Bartleby was still in the house! Sonic quickly grabbed the phone and dialed 911! \"Hello! Hello! Help me!\" The hedgehog screamed into the phone as he could see bartleby breaking through the glass window in the kitchen. There was glass shards wedged in the minks skin... blood pouring out of his mouth.\"I see found you baby\" That line... was what scared sonic the most.. The mink ran towards the hedgehog! but...! the hedgehog jumped to his side! Causing bartleby to run into the kitchen table and screaming in agonizing pain! Sonic climbed up to the top of the cubbor and grabbed a plastic cooking pan and hit bartleby in the head with it... bartleby did not move. The hedgehog... slowly got off the cubbord and nealed down next to the mink... \" is... is he dead? No! i wont alow it!!!\" The hedgehog said as he weeped... (edited)\r\n\r\n\"I found you baby\" Sonic was suddenly thrown againsgt the wall upside down. He saw bartleby running toward him... his teeth grinding together with anger. The mink proceeded to rape the blue wonder... Sonic realized something... this isnt rape... its love...?"
  },
  {
    "file": "2012-07-22 - Sonic Expression MEME.png",
    "description": ""
  },
  {
    "file": "2012-07-23 - 10 Sonic Underground facts you may not have known.png",
    "description": "10 true Sonic Underground facts you may not have known. But i did. "
  },
  {
    "file": "2012-07-23 - Classic Sonic kicks Modern Sonics ass.png",
    "description": "Requested by theorigamikiller\r\n\r\nHe requested for Sonic Underground Sonic to be beating up Modern Sonic. lol"
  },
  {
    "file": "2012-07-23 - Under the sea.png",
    "description": "Down where it's wetter... down where its better... take it... from bartleby...!"
  },
  {
    "file": "2012-07-24 - Bardonic (Bartleby x Sonic) Hey listen!.png",
    "description": "I don't play legend of Zelda. Never have, never will. It's A suckish ass game series. I just made this because Bartleby look's sexy as an elf. (Link is an elf right)\r\n\r\nThank you..."
  },
  {
    "file": "2012-07-24 - Bardonic Quest for Love - Coming soon.png",
    "description": "This is A comic I am working on. It will be about the relationship about Sonic and Bartleby, and how Manic deals with his brother being in love with this so called mink.\r\n\r\nI plan it to be around 5 - 10 pages only. If successful i'll add more to it. First page tomorrow! Stay tuned!"
  },
  {
    "file": "2012-08-03 - Bardonic (Bartleby x Sonic) Breakfast time!.png",
    "description": ""
  },
  {
    "file": "2012-08-03 - Bardonic. fix my junk baby.png",
    "description": "Just as Bartleby was having breakfast his TV died. Luckly he knew certain someone who could fix that junk right up! 🙂"
  },
  {
    "file": "2012-08-05 - Bardonic (Bartleby x Sonic) 500 page views!!!.png",
    "description": ""
  },
  {
    "file": "2012-08-05 - Bardonic (Bartleby x Sonic) Busted....!.png",
    "description": ""
  },
  {
    "file": "2012-08-05 - Bardonic makes the front page.png",
    "description": "Yup. I know what your all thinking. It's about time i get onto the front page. Well you know what? To tell you the truth im not suprised. I pretty much new it was going to happen sometime. Thanks to everyone who has been supporting me all this way. I could have done it without you, but thanks anyway."
  },
  {
    "file": "2012-08-05 - MY PICTURES ON GOOGLE.! FUCKIN SWEET!!!.png",
    "description": ""
  },
  {
    "file": "2012-08-08 - Bardonic (Bartleby x Sonic) Care to dance..png",
    "description": "Bartleby: Care to dance?...\r\n\r\nSonic: Yes Bartleby..."
  },
  {
    "file": "2012-08-08 - Bardonic (Bartleby x Sonic) Shy love....png",
    "description": "Sonic: H...h...he... hello. B...Bartleby...\r\n\r\nBartleby: Whats up baby?"
  },
  {
    "file": "2012-08-08 - Bardonic (Bartleby x Sonic) Swing Set Fun.png",
    "description": "\"Hey Knuckles! Head's up!\" Manic the hedgehog threw A paper airplane across the school bus hitting his good friend Knuckles in the back of the head. \"Ow! Manic what was that for?\" Knuckles said. \"Don't worry about it stupid echidna. He probably just missed because he was dreaming just dreaming of A bowl of re-fried beans or fried chicken.\" Sonic said leaning against his seat with his hands behind his head. \"Isn't that right fat ass?\" Sonic continued as he looked over at Manic.\r\n\r\n\"Shut up!\" Manic yelled as he stood up. \"Woah everyone! We've got A badass over here! Better hide all your food before this fat ass gulps it all down!\" Sonic said. Everyone laughed at Sonic's cruel yet somewhat true joke. \"but I... Sonia! Tell them i'm not A fat ass!...\" Manic said looking down A couple rows at his sister Sonia. Sonia just ducked and acted like she didn't hear him.\r\n\r\nAfter no response Manic just sat back down in his out shame.\r\n\r\n\"Hey bus driver! Are we almost there yet?\" Sonia said to the man driving the bus. \"Almost just 10 more minutes and we're there. \"Manic looked over A couple seats and saw the one person he loved in the entire world... Mindy Latour... She was just so damn sexy cause she had A big ass and wore lots and lots of makeup. He wanted to move closer to her so he decided to sneak down the aisle.\r\n\r\nHalfway there however... He was tripped... but who tripped him. He looked to his left to see his brother Sonic acting as if nothing happened. Was it him? No... it came from under the seat... and it felt like A hand. So there was no way it could have been Sonic. But... but whats under the seat? Manic looked under but didn't see anything. He knew something was there... Did Sonic sneak some animal of sorts on the bus? A dog? Pig? Mabey?... Even A person. Oh well. Better to just act like nothing happened.\r\n\r\nManic made his way down the Aisle to sit down next to the sexy bitch known as Mindy.\r\n\r\n\"Were here!\" The bus driver yelled! All the kids cheered as they ran out of the school bus and into the playground. What is happening you ask? Well it's A field trip! A field trip to the park! \"Come on Manic! Lets go on the slide!\" Knuckles said. Manic happily agreed. \"Hey bro! Wanna come hang out with me and Knux?\" Manic asked his blue colored bro. \"O...oh that's ok Manic. I just feel like sitting on the bus for A while!\" Sonic said.\r\n\r\n\"Well... okay. If you say so.\" Manic said running off the Knuckles.\r\n\r\n\"Come on Mindy. Lets go join them.\" Sonia said to Mindy. \"Okay.\" Mindy agreed.\r\n\r\nSoon after all the children were gone, Sonic made sure no one else was near or on the bus. \"You can come out now Bartleby.\" Sonic said. Bartleby Montclair of Dresdin, Sonic's one true lover then procceded to climb out from below the seats. He had trouble because of his huge muscles so Sonic had to help him out of course.\r\n\r\nBartleby had to sneak on board because he loved the playground, and he couldn't go because he was A 20 - 30 year old man, and it was just A field trip for the kids. but Bartleby just could not leave his lover alone knowing his lover was going to have so much fun without him.\r\n\r\n\"Where should we go now Bartleby?\" Sonic said. \"Swing set...\" Bartleby said pointing out the window at A new shiny red swing set the was just put up last week. \"Okay Bartleby lets...\" Sonic was interupted when he saw his lover already running out of the bus at high speeds. \"Bartleby wait! What if somebody sees you!\" Sonic screamed! Just then Bartleby ran into two people he knew very well. Knuckles and Manic! \"Gaaahhh!\" The two screamed as they slammed into A tree. \"Bartleby!\" Sonicran as fast as he could but Bartleby was just to fast for the small fat hedgehog!\r\n\r\n\"Bro! What is Bartleby doing here?! Did he sneak on board the bus? If the teacher finds out your in so much trouble!\" Suddenly Manic was interuppted by A cheering crowd far off in the distance. \"What is that?\" Knuckles said.\r\n\r\n\"Bartleby?\" Sonic wondered what was going on aswell. The three decided to go over and was very suprised at what the had witnessed. Bartleby was doing tricks on the swing set that no ordinary person could do! 360's, front flips, back flips. \"It's beautiful...\" Sonic said with tears in his eyes.\" Suddenly however! The line brock and Bartleby came tumbling down shattering his ankle! \"Gaaaaaaahhh!!!\" Bartleby let out A terrifying scream! The cheers then soon to become laughter. Bartleby started to cry.\r\n\r\n\"Stop it! Leave him alone!\" Sonic said running up hugging Bartleby. \"He's hurt! Can't you tell?! You Monsters!!! Monsters...\" Sonic began to cry just as much as Bartleby...\r\n\r\nBut Bartleby wasn't going to let the kids off so easily. Now Sonic was crying because of him. He started to scream and throw sand at the other children. \"GET OUT!!!\" Bartleby screamed! Some of the kids were able to ger away but some were thrown against the wall and others beaten. When he looked over at Sonic... now Sonic was scared of Bartleby... Sonic backed up in fear...Just then, Bartleby found out Sonic was vulnerable. He jumped on the beautiful hedgehog and raped him."
  },
  {
    "file": "2012-08-09 - Bardonic (Bartleby x Sonic) Carrot Season.png",
    "description": "The harvest is bountiful this year. So the lovers, Sonic the hedgehog and Bartleby montclaire of Dresdin head out to pick carrots."
  },
  {
    "file": "2012-08-09 - Bardonic (Bartleby x Sonic) Just married.png",
    "description": ""
  },
  {
    "file": "2012-08-09 - Sonic-Man and Manic the boy wonder..png",
    "description": ""
  },
  {
    "file": "2012-08-10 - My last picture before I move my account.png",
    "description": "My last picture before I get A new account with all new art. Bartleby and Sonic decide to pick berries with A bunch of kids from around the hood.\r\n\r\nEnjoy! 😉"
  },
  {
    "file": "2012-08-21 - Bardonic (Bartleby x Sonic) Almost to the top!.png",
    "description": "Bartleby as Batman\r\nSonic as Robin the boy wonder\r\n\r\nNow if this movie was made... that would be A dream come true..."
  },
  {
    "file": "2012-08-21 - Bardonic (Bartleby x Sonic) Rock Climbing.png",
    "description": "\"Wow!\" Was the only word that came out of Sonic's mouth as he looked upon mount Everest from below. He had never seen anything so damn big in his life. What made him even happier was... he was going to climb that piece of shit with his lover Bartleby Montclair of Dresdin.\r\n\r\nYou see, ever since Sonic was A baby his dream had always been to climb the tallest mountain in the world. He never had A chance to though because he never had the money... but now he can, because Bartleby bought mount Everest and gave it to Sonic for his birthday.\r\n\r\nSonic quickly put on his climbing gear and ran to the foot of the mountain to wait for his lover Bartleby to be ready. After about 5 minutes Bartleby came out of the changing room butt naked wearing nothing but his climbing rope.\r\n\r\nSonic immediately got A nose bleed but covered it up with his hands. \"Wow... B...bartleby. Where are you clothes?\" Sonic said covering his nose which was now gushing like garden hose. \"Oh yes. My muscles were to big so they just blew right off of my body.\" Bartleby said flexing his muscles.\r\n\r\n\"Oh. Again? That's to bad.\" Sonic said. \"Don't worry about it baby. I'm rich. I can just buy new clothes when we get back home. Then when those ones rip I can just buy another pair.\" Bartleby walked up to Sonic and gave him A good slap on the ass.\r\n\r\nThe two turned towards the mountain with determination in mind. \"Lets do this...\" Sonic said...\r\n\r\nafter about 5 minutes Sonic was still only about 20 feet off the ground. He was having fun though and that's all that mattered. He looked up at his lover Bartleby who was climbing so fast he was making 5 - 10 feet everyone few seconds. (Must be nice to have muscles.) Sonic thought to himself... (Must be even nicer to be hugged by thought muscles though...)\r\n\r\nSuddenly Sonic's hand slipped. (No! I gotta stop fanticising about Bartleby's muscles!) \"Bartleby! Help me!\" Bartleby looked down to see his lover about to fall to his death! Bartleby then jumped down the mountain onto A ledge right below Sonic. He caught the small fat hedgehogs in his arm. \"Thank you... Bartleby...\" Sonic said blushing...\r\n\r\nBartleby just dropping him and began climbing again. \"Hurry up baby. I didn't by this mountain for you to have fun. I bought it so I get get to the top and rape y... I mean... for both of us to have fun.\" Bartleby said.\"Yes! Of course Bartleby!\"The two climbed for A good 3 or 4 hours until it started to snow... \"Ah shit. Looks like we need to set up camp for the night. If we continue climbing we could turn into popsicles.\" Sonic said pulling out the tent.\r\n\r\nThe two set up the tent and were ready to climb in. Sonic climbed in first, then Bartleby. Bartleby had trouble because of his huge muscles but with Sonic's help they were both in. \"I love you Bartleby...\" Sonic said snuggling up against the muscular mink known as Bartleby Montclaire of Dresdin. \"I know.\" Bartleby said with an annoyed expression.\r\n\r\n\"I hope this storm blows over soon Don't your Bar-\" Sonic was cut off as the tent began to shake wildly from the wind! \"Bartleby! I'm scared!\" Sonic said rocking and turning! \"Be quiet bitch i'm trying to sleep.\" Bartleby said rolling over. Suddenly the wind got so strong it pulled Sonic out of the tent!\r\n\r\n\"Bartlebyyyyyyyyyyyy!!!\" Sonic screamed for his life! Bartleby heard his lovers cry for help and ran outside! \"Were you at baby?!\" He looked down the mountain and saw that sonic was now hanging by one thread of his pants. \"Bartleby! Help me!\" Sonic pleaded... Bartleby looked his backpack but couldn't find anything that could help the small fat cutie pie. \"Yo my bitch! Where's your backpack!\" Bartleby yelled! \"It's in the tent!\" Bartleby looked in the tent and found the said backpack. He was in such A hurry however that he just ripped the whole thing open! Inside he found some money, toothpaste, and gum. He took that and put it in his pocket. (He won't be needing these now!) He thought to himself.\r\n\r\nThen... He found A rope! He pulled the rope out and tied end to A rock on the mountain and tied the other end to his waste! He looked down the mountain. Only one shot. He's gotta make it count... Bartleby jumped off the mountain. Sonic looked up with tears of joy in his eyes. His lover was going to save him...\r\n\r\nSuddenly Bartleby flew past Sonic and was now out of sight... \"He ditched me... HE DITCHED ME!\" Sonic said crying and ramming his fist against the mountain. \"I thought you loved me Bartleby! I thought we loved each other!!!\" Sonic punched the mountain so much his hand began to bleed.\r\n\r\nAfter 3 days passed the storm was over and Sonic was still dangling by the thread... He gave up hope. \"No one is ever going to rescue me... I'm going to die out here...\" He said..\r\n\r\nThen... He heard something in the distance... \"A... Helicopter...\" Then... A helicopter came into view! On the side of the vehical said \"Bartleby's shit\" \"Bartleby must have bought A helicopter to come and rescue me!\"\r\n\r\nBartleby jumped out of the helicopter and landed on the ledge right above Sonic. He reached him hand down. It was grabbed by Sonic's cold frost bitten hands... \"Bartleby... Thank you...\" Sonic was pulled up onto the cold hard ledge... He was finally.... FINALLY... safe and sound... Or so he thought!\r\n\r\nBartleby Montclair of Dresdin punched Sonic in the neck making the hedgehog cough up blood! \"W...why?!\" Sonic said allowed! Bartleby then began to rape the beautiful hedgehog like there was no tomorrow! Sonic's screams could be heard from miles away! Wait... Miles away?! So this is the real reason Bartleby bought Sonic mount Everest for his birthday... So no one could hear his rape... So Bartleby was doing it for him. His lover... Bartleby must not have wanted anyone to ruin there time of lover. So Bartleby really did lover Sonic... \"Bartleby... Thank you...\" Sonic said giving his Body to the posh mink. \"Be quiet baby!\" Bartleby said punching Sonic in the face.\r\n\r\n\"I love you... Bartleby...\" Sonic cried tears... of joy..."
  },
  {
    "file": "2012-08-21 - Bardonic (Bartleby x Sonic) Starry night....png",
    "description": "\"Lets go Bartleby!\" Sonic and his lover Bartleby Montclair of Dresdin ran off into the open field. Every night Sonic would come to his secret area to look up at the beautiful stars, but this is the first time he has ever brought anyone with him. His secret area is right outside mobotropolis in the middle of the forest. In this part of the forest the trees were placed around in A big circle. In the middle of that circle was an open field were the grass was always green and the skies would shine bright with stars...\r\n\r\n\"Isn't this great Bartleby? It's my secret area.\" Sonic said to the beautiful mink. \"It's not nearly as good as my bathroom\" Bartleby said picking up A rock and throwing it at sonic hitting him over the head. \"Gaaahh! W...well of course Bartleby. Your rich after all. Your can afford A huge and glorified bathroom. It's just at... Isn't this beautiful? What nature has created?\" Sonic said trying his best to get up. \"No.\" Bartleby said kicking sonic in the gut knocking him back on the floor.\"\r\n\r\n\"Now when can we go? This place is stupid.\" Bartleby said as he forcefully picked up the small fat hedgehog and pushed him back on his feet. \"Well... we can go in A minute Bartleby. I just want to show you something.\" Sonic ran over to the bottom of A tree and waved Bartleby to come over. Bartleby did just that.\r\n\r\n\"Follow me Bartleby\" Sonic began to climb up the tree. \"Wait just A minute. You expect me to climb this shit?\" Bartleby said. \"Well if you don't want to see my secret then...\" Sonic was interrupted as he saw Bartleby walking away. \"Bartleby! Were are you going? Don't you want to see my secret?\" Sonic said... \"Hell no. If it doesn't cost money it isn't worth my time.\" Bartleby said walking off.\r\n\r\n\"O...oh right...\" Sonic said with tear filled eyes.\r\n\r\nSuddenly however... he heard voice... Bartleby stopped as well. Who could it be? It sounded like A big group. The two looked at each other then to the right where the voices were coming from... Suddenly A group of 7 - 8 black people came into view.\r\n\r\n\"Niggers... Bartleby! Get over here quick!\" At that exact moment the two lovers were noticed by the black people! \"Check it out Nigga's! We got some fresh meat over there!\" One of the black people pointed out. \"No way man! Look over there! That guy is Bartleby Montclair of Dresdin. They say he's the richest man on the planet. We could make some real dough of the that white man! What do you say Nigga's! Should we get em?!\" Said another black man. All the Niggers shouted and began to run towards the two!\r\n\r\nBartleby ran towards the tree were Sonic was! \"Hurry Bartleby!\" The black people were running so fast they were like A blur. Out of the corner of Sonic's eye he could even see one of them running with A tv! (How can they still run that fast with A tv?) Sonic wondered. Bartleby grabbed Sonic's hand just at the right time and was pulled up onto one of the high branches. The niggers were all crowding around the bottom of the tree cussing and throwing pieces of watermellon and old KFC bones at the two.\r\n\r\nAre you okay?... Bartleby?...\" Sonic said. Suddenly without warning... Sonic was hit over the head with A huge watermelon! \"Sonic!\" Bartleby yelled! but Sonic couldn't hear him. He was passed and was now falling out of the tree... Thankfully however... Bartleby caught his foot just in time!\r\n\r\nIt didn't help much though. All the black people down at the bottom had grabbed both of Sonic's arms and his head! They were to much to handle. Even for Bartlebty's stiff muscles. \"Bartlby... help... me...\" Sonic muttered... Bartleby could see the tears streaming down Sonic's face... even if his face was being beaten by the niggers... \"Bartleby...\" Sonic said in between punches...\r\n\r\n\"Your on your own fatass!\" Bartleby said climbing up the tree away from the black people! \"BARTLEBYYYYYYY!!!\" Sonic yelled as loud as he could! Every now and then we would be punched in the gut making his voice wither... \"Bartle...\" Sonic was stomped in the face. He face was so bloody and fucking jacked up you could even tell it was his face anymore. Maybe his ass but not his face...\r\n\r\nAfter 5 constent hours of pure beating and torture the black people just took Sonic's money and left. \"Have fun cracker!\" One nigger yelled stabbing Sonic in the arm with A fried chicken bone before getting up to meet up with the rest of the black people...\r\n\r\nCaugh... \"Bartle...\"Caugh...* \"By...\" Sonic got up. it hurt him. He could feel his spine sticking out through his back and his rib cage was now poking into his lungs... \"I must make... sure... that Bartleby is... Okay...\" Sonic said getting to his feet. He was knocked out for so long he wasn't able to see what happened to his lover... \"Bartle...by... please be...Okay...\"\r\n\r\nSonic made his way to the tree. Sonic began to climb... branch after branch was like him going through A living hell... but he must go through this pain... for Bartleby... After all was said and done he got to the final branch... What he saw up there shocked him.\r\n\r\nBartleby was sitting up there alone with A big smile on his face and tears of happiness pouring down. Sonic wondered what was making him so happy. Shouldn't he be worried about the beating his lover Sonic took? Then... Sonic Looked up... The sky was filled with stars... Millions and millions of beautiful stars...\r\n\r\nSonic crawled over and made his way to Bartleby... He wanted to join the mink on this glorious night...\r\n\r\nJust then however Bartleby turned around! His eyes filled with lust! He grabbed Sonic by the neck and threw him against the trunk of the tree! \"GAAAAHHH!!! B...Bartleby... W..what is this?!\" Sonic said! He could hardly breath and was coughing up blood. Bartleby jumped upon the beautiful hedgehog and raped him like there was no tomorrow! \"Bartleby! St...stop it! Please!!!\" Sonic screamed! Tears ran down sonic's face as he heard the crowd of black people cheering at the bottom of the tree! Bartleby gave them A thumbs up and continued his rape!\r\n\r\nThen Sonic realized... Did Bartleby hire them to beat down Sonic and make him vulnerable to rape?! Bartleby nodded yes almost as if he was reading Sonic's mind... Sonic closed his eyes and decided to except his destiny... Then the truth hit him... he loved Bartleby... Bartleby actually planned all this just to make love with his loved one... no ordinary person would have done this...\r\n\r\n\"I love you Bartleby... Do you love me?...\" - Sonic\r\n\r\n\"Okay...\" - Bartleby\r\n\r\nAll night that forest was filled with the sound of Sonic's beautiful voice screaming and A crowd of black people cheering... The... End..."
  },
  {
    "file": "2012-08-21 - Bardonic (Bartleby x Sonic) Winter fun....png",
    "description": ""
  },
  {
    "file": "2012-08-21 - Bardonic (barletebyXsonic). mowin the lawn.png",
    "description": "Sonic decides to mow the lawn today, but with a little help from his lover. Bartleby monclair of dresdin..."
  },
  {
    "file": "2012-08-22 - Bardonic. Live GRANDE Like A Burrito.png",
    "description": "Sonic and bartleby stepped out of the limmo. Why did they have a limmo you ask? It was the grand opening of the new mexican restruant \"Live Grande Like A Burrito\". The little blue hedgehog was suprised to see that there werent any cars parked out front. Was The restruant nothing but failure? No. He and bartleby would be the judge of that. \"Come on bartleby lets go inside.\" The hedgehog said. \"Okay baby\" The mink pushed the hedgehog on to the ground to the side. He was now running for the door at lightning speed... Sonic couldnt help but giggle at this. Bartleby at a restruant was like a child in a toy store.\r\nAs sonic caught up to the sexy mink he noticed that the sign on the wall said it opens at 10:00 AM. It was now 10:05 AM. Well that makes sense. Noone showed up yet because it was still only open for 5 minutes. The two lovers stepped into the door to see a mexican into a sombrero and pancho wating to seat them. \"Bartleby... im scared.\" The hedgehog said. The mexican man made a gesture pointing to the left. Was he taking them to their seat? Yes perhaps he was. The mink and the hedgehog sat in the booth,and looked to the mexican man who was trying to speak to them. Of course the mexican couldnt speak very good english, but he did the best he could. \"Looks bartleby the burrito is trying to speak our language\".\r\n\r\nBartleby snorted in laughter and agreement. The mexican left to get the drinks. 5 minuts had passed... then 10... then 30... then an hour... The fat blue hedgehog was started to get worried. What takes so long to get two drinks. But then he remembered. They are dealing with a mexican after all.\r\nSonic heard wheels come to stop. Luckly they were sitting by the window so they could see the parking lot. 2 vans were parked simultaneously away from eachother but still close enough to the restruant for any small family to come enjoy a nice meal. Sonic New what was about to happen. He looked up to see a banner hanging on the wall. It only read to words. \"Taco day\"... Suddenly as soon as sonic finished reading it, almost on cue, about 25+ mexicans were swarming out of each van! They were racing into the the restruant! It was \"taco day\"! The new years for mexicans. \"Bartleby!\" The hedgehog screamed as the mexicans were pulling the fat blue hedgehog out of his seat! They were shooting green pepper juice into his eyes... \"Help me!!!\" The hedgehog said. Bartleby grabbed a fallen sombrero off the ground and used it to smash open the window. \"Grab my hand baby\" The mink said as he reached for the hedgehog! Sonic grabbed his lovers hand, but the mexicans pulled back... They were to strong for the mink... As soon as the mexicans came in, they had left. There were no more tacos, burrito, or anything else mexicans eat... Are you okay baby? The mink said as he walked up to the hedgehog. \"I think so... thank you bartleby.\" The hedgehog said getting up. When mexicans come in swarms not even god can stop them. \"Well bartleby... lets go home...\" the fat blue hedgehog was walking back to the limmo... \"its rape time baby\" The mink ran up and grabbed the hedgehog. He raped the hedgehog. He didn get any tacos today, but he got something more important... love...\r\n\r\nLive grande like a burrito."
  },
  {
    "file": "2012-08-23 - Bardonic (Bartleby x Sonic) Balloon Festival.png",
    "description": "Bardonic BALLOON FESTIVAL:\r\n\r\nSonic the hedgehog loved hot hair balloons. He always loved then. Even when he was A baby he would get so fucking excited whenever the hot air balloon festival would come to town, and this years wasn't any different... Actually, scratch that. Something was different this year. For once He was going to participate in the festival all thanks to his boyfriend Bartleby, Montclair of dresdin. Since Bartleby was rich, it was an easy task buying something as cheap as A hot air balloon.\r\n\r\n\"Wow Bartleby... thanks. No one ever bought me A hot air balloon before... Your the best you know that baby?\" Sonic said. Bartleby wasn't paying attention to the small fat hedgehog. He was to busy tying bags of sand to the side of the balloon. \"You no Bartleby. I sometimes get scared of height's. If this happens... do you mind holding me?\" Sonic said blushing A bit. This caught Bartleby's attention. He turned around and looked at sonic. After A couple seconds he snorted in agreement and continued to tie the bags of sand down.\r\n\r\n\"Hey bro!\" Suddenly, A voice was heard of in the distance... \"This fuck?!\" Sonic said looking far off in the distance. \"Just then A green thing came into view.. \"Ah shit!\" Sonic said aloud. It was someone he hated very much. his bro Manic the hedgehog. was running up to the balloon at high speeds. \"Bartleby! Quickly! Add the fuel!\" Bartleby poured the gas in at the speed of light! \"Hurry!\" Sonic yelled.\r\n\r\nThe two lovers were not fast enough however as Manic jumped into the basket. \"Hey bro! What's up?!\" Manic said putting his arm around his blue bros shoulder. \"Not your business dumbass. Why are you even here?\" Sonic said looking away. He was very disappointed. He wanted this day to just belong to him and Bartleby. What's more beautiful than two lovers in A balloon flying high over the town? Sonic will tell you. Nothing... \"You know bro. I think we should hang out more. Ever since you started to hang out with your boyfriend Bartleby, it's almost as if you forgot all about me. In fact I know how we can start. How about the three of fly in this balloon together? It will be fun.\" Manic said.\r\n\r\nSuddenly Sonic punched his gunky bro across the face! Manic's head slammed into the hard poll hooked to the balloon. Blood was pouring out of his nose and mouth. \"How about instead you leave me and Bartleby alone shit head!\" Sonic said punching him in the face once more. Bartleby laughed. Manic was about to fall to the ground as Sonic grabbed him by the vest and kneed him in the gut. Manic then his the ground with A thud. Sonic then began to repeatedly kick at Manic's motionless body as it laid on the floor. \"Help me Bartleby!\" Sonic yelled. Bartleby joined in with A big smile on his face.\r\n\r\n\"You to! Stop what your doing and step out of the balloon!\" Suddenly A group of 10 - 15 police officers came running up out of nowhere. Sonic and Bartleby stopped kicking the motionless body and put this hands up without hesitation. \"Well... This is it Bartleby...\" Sonic said. \"Step out of the the balloon with your hands up.\" Said A man with A blow horn. Bartleby looked down and could see tears welling up in the small fat hedgehogs eyes. \"No...\" The beautiful mink said. \"What?\" Sonic said looking up at his lover. \"NO!!!\" Bartleby yelled! He He poured in the fuel, lit the fire and the balloon flew high into the sky!\r\n\r\n\"Open fire!\" The police fired at the balloon but with no avel. Since Bartleby was rich he bought the balloon from an illegal Mexican in A van. Since it was made by A Mexican, the balloon was bullet proof. \"You... you did it Bartleby. You saved us. Bartlebt wasn't paying any attention to his blue lover. He was to busy sticking his middle finger out at the police from above. Sonic wanted to join in on the taunting to so he stuck his upper body out out of the basket. \"Later Suckaaaaaa~\" BAM! Suddenly Sonic was shot in the right shoulder! He felt head first of the balloon! \"BARTLEBY!!!!\" Sonic yelled for his life!\r\n\r\nThankfully Sonic's foot had caught onto A rope just before he had fallen out! \"Bartleby! Help me!\" Bullets flew past Sonic at high speeds. Bartleby didn't wan't to risk getting his so he just ducked and laughed at poor hedgehogs torture. After almost 30 minutes they were so high they could barely even see the ground anymore. It was safe to come out now.\r\n\r\nBartleby looked over the edge to see his lover still dangling. Bartleby started to pull the rope up to rescue the small fat hedgehog. Just before Sonic was near the top however, Bartleby let go of the rope! \"Wahh?! BARTLEBYYYYYY!!!\" Sonic was dropped once again. Since the rope was still tied around his leg, his leg broke broke from the jolt! Tears ran down the hedgehogs face. Bartleby only laughed at this and pulled the hedgehog back into the basket. \"Joke... Funny...\" Bartleby said in between giggles.\r\n\r\n\"Bartleby. You saved me from those police... thank you.\" Sonic said picking up his bros corpse. \"Now lets get rid of this ugly ass shit.\" Sonic threw his gunky bro out over the of town. \"Heh. I wonder was janitor is going to clean up THAT big pile of shit.\" The two laughed.\r\n\r\nSonic opened his backpack to pull out an egg salad sandwich and an unopened can of cream and mushroom soup. \"Hey Bartleby. Are you hungry? If you are we could share are-\" Suddenly. The mink pinched Sonic's ass so hard it began to bleed! The blue hedgehog screamed in pain! Then Bartleby grabbed the can of cream and mushroom soup and slammed it into Sonic's head. Mushroom, blood, and cream flew everywhere. \"B...Bartleby! Why?!\" The mink then began to rape the beautiful hedgehog. Sonic's screaming then began to get fucking annoying so Bartleby shoved the egg salad sandwhich into the hedgehogs mouth.\r\n\r\n\"How do you like that bitch?!\" Bartleby said was he banged the hedgehog like there was no tomorrow! Then Sonic realized. Did he love Bartleby? He did. No ordinary person would have raped him. It MUST have been love...\r\n\r\n\"I love you Bartleby...\" Was the last thing Sonic said before going unconsious..."
  },
  {
    "file": "2012-08-24 - Bartleby x Sonic Wash my ass and i'll wash yours.png",
    "description": "Sonic the hedgehog giving his lover A scrub down of a life time. 😉 Oh Sonic. What is going through your mind you little bitch..."
  },
  {
    "file": "2012-10-15 - Bardonic (Bartleby x Sonic) A happy halloween!.png",
    "description": ""
  },
  {
    "file": "2012-10-16 - Bardonic (Bartleby x Sonic) Movies HD ver..png",
    "description": ""
  },
  {
    "file": "2012-10-19 - Bardonic (Bartleby x Sonic) Fall weather....png",
    "description": "Fall is almost here. The cold fall breeze, the sound of leaves crunching under foot, The cries Sonic screams when him and Bartleby are having sex in the leaf pile. 😉\r\n\r\nSonic: \"Hehe! Oh Bartleby! I just raked these leaves.\"\r\n\r\nBartleby: \"You can rake them some other time babe. For now lets just have some fun\""
  },
  {
    "file": "2012-10-20 - Bardonic (Bartleby x Sonic) Diner.png",
    "description": ""
  },
  {
    "file": "2012-10-20 - Bardonic (Bartleby x Sonic) Life of a pirate.png",
    "description": ""
  },
  {
    "file": "2012-10-20 - Bardonic (Bartleby x Sonic) Run babeh run.png",
    "description": ""
  },
  {
    "file": "2012-10-20 - Bardonic (Bartleby x Sonic) Search of A legend....png",
    "description": ""
  },
  {
    "file": "2012-10-20 - Bardonic (Bartleby x Sonic) Search of A legend...2.png",
    "description": ""
  },
  {
    "file": "2012-10-20 - BartlebyXSonic Show me the green light.png",
    "description": ""
  },
  {
    "file": "2012-10-20 - Bros... Before and after....png",
    "description": ""
  },
  {
    "file": "2012-10-24 - Bardonic (Bartleby x Sonic) Christmas card's.png",
    "description": "Christmas is coming up and whats a better way than to send all your friends and family wonderful christmas cards. And thats just what bartleby and sonic plan to do. 🙂"
  },
  {
    "file": "2012-10-24 - Bardonic (Bartleby x Sonic) Mouth... To mouth....png",
    "description": "Bartleby: Sonic... My love... You will make it. I promise you... Bartleby gives Sonic mouth to mouth\r\n\r\nSonic: B...Bartleby...?\r\n\r\nBartleby: Welcome back... baby...\r\n\r\n(Yah I didn't really try that hard on this one. It was only really made for one of my youtube videos. ^__^'"
  },
  {
    "file": "2012-10-24 - Bardonic (Bartleby x Sonic) Paint my Oranges baby.png",
    "description": ""
  },
  {
    "file": "2012-10-24 - Bardonic (Bartleby x Sonic) Towering inferno.png",
    "description": "Bartleby monclair of dresdin and his lover Sonic the small fat cutie pie were in the middle of having sex. When all of a sudden a flame arises. Unfortunately The posh mink left a pot of mac and cheese atop the stove. It was burning red hot. Bartleby quickly jumped to action to save his lover telling him to run... far away..."
  },
  {
    "file": "2012-10-24 - Bardonic (Bartleby x Sonic) You keep me rocking.png",
    "description": ""
  },
  {
    "file": "2012-10-25 - Bardonic (Bartleby x Sonic) Just Married!.png",
    "description": "Bartleby and Sonic have just gotten married. So they are going on there honeymoon. Everyon is there to see them off. Including Sonic's sibs Manic, and Sonia, and there good friend Knux."
  },
  {
    "file": "2012-11-15 - Suck Sonic Underground Balls.png",
    "description": "Comment and favorite! 😉 I made these myself in gimp!\r\n\r\nGreen: manic\r\nBlue: Sonic\r\nRed: Knuckles\r\nPink: Sonia\r\nYellow: Bartleby"
  },
  {
    "file": "2012-11-30 - Bardonic (Bartleby x Sonic) Manic's mucnuggets.png",
    "description": "Manic's mucnuggets\r\nI was bored."
  },
  {
    "file": "2012-11-30 - Bardonic (Bartleby x Sonic) Playplace... Of dreams.png",
    "description": "This pic was inspired by my childhood. I use to play in the mcdonalds playplace all the time. (and to my guess Sonic and Bartleby did to)\r\n\r\nSonic decided to play in the playplace while Bartleby waiting downstairs eating his food. Unknown to Sonic though, Bartleby has \"other\" things in mind. 😉"
  },
  {
    "file": "2012-11-30 - Bardonic (Bartleby x Sonic) Weve come far....png",
    "description": "I have just recieved my first fanart. It was made by :iconhedgestar: Who is now a good friend of mine. Keep up the good work everyone! Just as i will keep up mine. 🙂\r\nhttps://youtu.be/E5XuflU4r9g Be sure to check out my new vid 😉"
  },
  {
    "file": "2012-11-30 - Bardonic (Bartleby x Sonic) shopping for love....png",
    "description": "Sonic needs to go shopping for some groceries at the super market... but it seems Bartleby wants to play A game with the cute fat hedgehog instead. 😉"
  },
  {
    "file": "2012-11-30 - Playplace of dreams... (Manic version).png",
    "description": ""
  },
  {
    "file": "2012-12-01 - Bardonic (Bartleby x Sonic) fall for his life...!.png",
    "description": ""
  },
  {
    "file": "2012-12-01 - Bardonic (Bartleby x Sonic) fall for his life...!2.png",
    "description": "Bardonic (Bartleby x Sonic) fall for his life...! 2. (Bartleby has A smaller bulge this time. Just for you :iconmrelementron-da:"
  },
  {
    "file": "2012-12-01 - Fixed.png",
    "description": "Fixed version of :iconcutiebunch: Bardonic picture. (He took it down for some reason) Lol the noob accidentally made Sonic modern version instead of classic."
  },
  {
    "file": "2012-12-02 - Bardonic (Bartleby x Sonic) 2000 pageviews.!.!.!.!.png",
    "description": ""
  },
  {
    "file": "2012-12-02 - I am the hero deviantart needs.png",
    "description": ""
  },
  {
    "file": "2012-12-02 - My Bartleby and Sonic costumes.png",
    "description": "Finally able to upload them! 🙂 These are my two sonic and bartleby costumes. Heres a link to a video of it if you want to see me do awesome poses in it! 😉"
  },
  {
    "file": "2012-12-02 - My favorite characters from Sonic Underground.png",
    "description": "Bartleby,Sonic,Manic,Sonia,and Knuckles. I didn't have enough room to draw mindy but she should be up there to.\r\n\r\nI was bored."
  },
  {
    "file": "2013-01-03 - Bardonic (Bartleby x Sonic) How to tell Bartleby...png",
    "description": "Sonic is having some problems telling Bartleby about his true feelings so he decides to go to the best place to get some help... THE LIBRARY!!!"
  },
  {
    "file": "2013-01-03 - Mindick (storm).png",
    "description": "Manic is struck by the god of the clouds... Mindy"
  },
  {
    "file": "2013-01-03 - Sonic underground Animation preview.png",
    "description": "Our brand new S.U. animation is in the works everyone! Here a special preview so you guys can guess what it could be about... 😉\r\n"
  },
  {
    "file": "2013-01-04 - 1.png",
    "description": "Yup. A brand new dvd. Here the link if you wanna see my new unboxing video! [link]\r\nIts on my youtube page! 😉"
  },
  {
    "file": "2013-01-04 - The cupcakes of SU.png",
    "description": "They look delicious don't they? I make them last night. They were made for A special Sonic Underground marathon I had by myself. xD"
  },
  {
    "file": "2013-04-16 - Bardonic (Bartleby x Sonic) Race of Love.png",
    "description": ""
  },
  {
    "file": "2013-06-17 - Bardonic (Bartleby x Sonic)This wall feels like....png",
    "description": ""
  },
  {
    "file": "2013-06-17 - Bardonic(Bartleby x Sonic) Knight in shining armor.png",
    "description": ""
  },
  {
    "file": "2013-06-18 - Bardonic (Bartleby X Sonic) - Surfing those wave's.png",
    "description": "Thanks to Bartlebys private jet the two lover were able to vacation in Hawaii! Its a good thing them to surfing lessons before they got there!. 😉"
  },
  {
    "file": "2013-06-18 - Bardonic(Bartleby x Sonic) A little sun....png",
    "description": "Sonic has entered the sand castle tournament. Can he possibly win?! The judges said he will win if he can add one more flag, but to Sonic's dismay, he is all out of flags... but just in the nick of time Bartleby shows up out of nowhere with flag in hand. His sweaty body was sexy. With the flag Sonic wins the tournament and the two of them have sex."
  },
  {
    "file": "2013-09-11 - Bardonic(Bartleby x Sonic) Busted....png",
    "description": "Police: You are under arrest!\r\n\r\nSonic: I... i'm scared Bartleby... So scared...\r\n\r\nBartleby: It's okay baby. Don't worry. i qill protect you...\r\n\r\nSonic: Bartleby: Wipes tears away Y... YES! BARTLEBY!\r\n\r\nPolice: Open fire!!!\r\n\r\nBartleby picks up sonic and they flip around at the speed of light. bartleby picks up A gun, kicks off the cop car and spins firing A tornado of bullets at the polic around them. The two of them land. Everything around them is dead silent for A good few minutes... Then the police drop dead...\r\n\r\nSonic: Bartleby... your my guardian angel... bless you...\r\n\r\nSonic and Bartleby then have sex on top of A cop car. Bartleby bangs sonic so faster and hard that the cop car is crushed underneth them."
  },
  {
    "file": "2013-09-11 - Bardonic(Bartleby x Sonic) Gimme some sugar baby.png",
    "description": ""
  },
  {
    "file": "2013-09-11 - Bardonic(Bartleby x Sonic) Storm of love.png",
    "description": "A plane just crashed in a dangerous wild land. The only two survivors are Sonic and his lover Bartleby. Fortunately they have been rescued by a Manic with his camper van."
  },
  {
    "file": "2013-09-11 - Bardonic(Bartleby x Sonic) This week on cook off...png",
    "description": ""
  },
  {
    "file": "2013-09-11 - Bardonic(Bartleby x Sonic) looks for bigfoot.png",
    "description": ""
  },
  {
    "file": "2013-09-11 - Bartleby's butt.png",
    "description": ""
  },
  {
    "file": "2013-09-11 - Sonic just ate the best burrito(video inside).png",
    "description": ""
  },
  {
    "file": "2017-11-06 - Sonic and Bartleby... Light and Dark... Bardonic...png",
    "description": "Two lovers... Bartleby and Sonic... stand on the grounds of the jedi temple... One following the light... the other the dark. Can their love for each other unite the light and dark side of the force?...\r\n\r\nLol just a cute little au I thought of. What if Sonic and Bartleby were int he world of star wars."
  },
  {
    "file": "2017-11-06 - Sonic the Hedgehog and Bartleby picking flowers..png",
    "description": "Sonic knew he and bartleby were going on a date in the flower patch... But what he didn't know was that his lover, Bartleby had stripped down completely naked 😉 Hot damn"
  },
  {
    "file": "2019-02-06 - Bartleby X Sonic - Before the war.png",
    "description": ""
  },
  {
    "file": "2019-02-06 - Bartleby and Sonic snuggle by the fire.png",
    "description": ""
  },
  {
    "file": "2019-02-06 - Bartleby and his lover Sonic the hedghog cosplayin.png",
    "description": ""
  },
  {
    "file": "2019-02-06 - Bartleby as a pokemon card.png",
    "description": ""
  },
  {
    "file": "2019-02-06 - Bartleby x Sonic (Bardonic) Bowling.png",
    "description": ""
  },
  {
    "file": "2019-02-06 - Bartleby x Sonic (Bardonic) RED CARD....png",
    "description": ""
  },
  {
    "file": "2019-02-06 - The Hedgehog family buys the Star Shower!!.png",
    "description": ""
  },
  {
    "file": "2019-02-07 - Bardonic (Bartleby x Sonic) Ice Skating.png",
    "description": ""
  },
  {
    "file": "2019-02-07 - Sonic and Bartleby sharing Bush's baked beans.png",
    "description": ""
  },
  {
    "file": "2019-02-08 - Bardonic (Bartleby X Sonic) Beauty On Ice.png",
    "description": ""
  },
  {
    "file": "2019-02-08 - Uncle Chuck open his christmas present.png",
    "description": ""
  },
  {
    "file": "2019-03-09 - Sonic Underground Comic Series Episode 1 (Cover).png",
    "description": ""
  },
  {
    "file": "2019-03-09 - Sonic Underground Comic Series Episode 1 (Page 1).png",
    "description": ""
  },
  {
    "file": "2019-03-09 - Sonic Underground Comic Series Episode 1 (Page 2).png",
    "description": ""
  }
]